{
	"common": {
		"active": "Actif",
		"expired": "Expiré",
		"inactive": "Inactif"
	},
	"views": {
		"apiKeys": {
			"addDomain": "Ajouter un domaine",
			"apiKey": "Clé d'API",
			"cannotAddToExpired": "Vous ne pouvez pas ajouter un domaine à une clé expirée.",
			"domain": "Domaine",
			"expiresOn": "Expire le",
			"generateNewKey": "Générer une nouvelle clé",
			"messages": {
				"error": {
					"addApiKey": "Une erreur s'est produite lors de la génération de la clé d'API.",
					"addDomain": "Une erreur s'est produite lors de l'ajout du domaine.",
					"deleteApiKey": "Une erreur s'est produite lors de la suppression de la clé d'API.",
					"deleteDomain": "Une erreur s'est produite lors de la suppression du domaine.",
					"updateApiKey": "Une erreur s'est produite lors de la mise à jour de la clé d'API."
				},
				"success": {
					"addApiKey": "La clé d'API vient d'être générée avec succès.",
					"addDomain": "Le domaine vient d'être ajouté avec succès.",
					"deleteApiKey": "La clé d'API vient d'être supprimée avec succès.",
					"deleteDomain": "Le domaine vient d'être supprimé avec succès.",
					"updateApiKey": "La clé d'API vient d'être mise à jour avec succès."
				}
			},
			"modals": {
				"addDomain": {
					"domainName": "Nom de domaine",
					"domainNameError": "Le nom de domaine est invalide. Entrer un nom sous le format 'domaine.com'.",
					"enterDomain": "Entrer le nom de domaine (ex: domaine.com) que vous désirez ajouter à la clé d'API.",
					"note": "Veuillez noter que par défaut, \"localhost\" est déjà fonctionnel et que la version avec \"www\" de votre domaine fonctionne aussi.",
					"title": "Ajouter un domaine à la clé d'API."
				},
				"common": {
					"associatedWillStopWorking": "Tous les éditeurs associés refuserons immédiatement de nettoyer le texte collé."
				},
				"deleteApiKey": {
					"areYouSure": "Êtes-vous sûr de vouloir supprimer cette clé d'API ?",
					"title": "Supprimer une clé d'API."
				},
				"deleteDomain": {
					"areYouSure": "Êtes-vous sûr de vouloir supprimer ce domaine ?",
					"title": "Supprimer le domaine"
				},
				"updateApiKey": {
					"expirationDate": "Date d'expiration",
					"pleaseSelect": "Veuillez sélectionner une nouvelle date d'expiration pour la clé d'API.",
					"title": "Mettre à jour la date d'expiration."
				}
			},
			"pleaseAddDomain": "Veuillez ajouter un domaine pour activer la clé.",
			"title": "Clés d'API",
			"youHaveReached": "Vous avez atteint le maximum de clés d'API. Si vous avez besoin d'une nouvelle clé, veuillez d'abord en supprimer une."
		}
	}
}
